# EJEMPLO PRACTICO PARA PANDAS CON DATAFRAMES

## 1.Inpeccion inicial del DataFrame

In [27]:
import pandas as pd

In [28]:
#diccionario de listas
data = {
    'Nombre': ['ana','Luis', 'lucia', 'martha','jorge', 'sofia', 'angel'],
    'Edad':[29,27,50,36,56,23,42],
    'Ciudad':['monterrey','cdmx', 'guadalajara', 'puebla', 'cdmx','guadalajara', 'cdmx'],
    'Salario':[12000,15000,18000,12000,14000,13000,15500],
    'Departamento':['ventas', 'TI', 'marketing','ventas','TI','ventas', 'marketing']
}

In [29]:
#crear data frame
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad  Salario Departamento
0     ana    29    monterrey    12000       ventas
1    Luis    27         cdmx    15000           TI
2   lucia    50  guadalajara    18000    marketing
3  martha    36       puebla    12000       ventas
4   jorge    56         cdmx    14000           TI
5   sofia    23  guadalajara    13000       ventas
6   angel    42         cdmx    15500    marketing

# 2.Estuctura data frame

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [31]:
#mustra el tamanio del dataframe
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   37.571429  14214.285714
std    12.340410   2157.489723
min    23.000000  12000.000000
25%    28.000000  12500.000000
50%    36.000000  14000.000000
75%    46.000000  15250.000000
max    56.000000  18000.000000

In [32]:
#mustra el nombre de las columnas
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [33]:
#muestra valores de columnas
df.dtypes

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

# Seleccion de columnas y filas

In [35]:
df['Edad']

0    29
1    27
2    50
3    36
4    56
5    23
6    42
Name: Edad, dtype: int64

In [36]:
type(df[['Edad']])

pandas.core.frame.DataFrame

# 4.Filtrado de filas

In [39]:
#FILTRAR LAS FILAS QUE LA CIUDAD SEA CDMX
df['Ciudad'] == 'cdmx'

0    False
1     True
2    False
3    False
4     True
5    False
6     True
Name: Ciudad, dtype: bool

In [44]:
df_cdmx = df[df['Ciudad'] == 'cdmx']

In [45]:
df_cdmx[['Nombre','Ciudad','Salario']]

  Nombre Ciudad  Salario
1   Luis   cdmx    15000
4  jorge   cdmx    14000
6  angel   cdmx    15500

In [49]:
#mostrar todas las filas de la ciudad de mexico y del departamento de ti
df[(df['Ciudad'] == 'cdmx') & (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
1   Luis    27   cdmx    15000           TI
4  jorge    56   cdmx    14000           TI

In [50]:
df[(df['Ciudad'] == 'cdmx') | (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
1   Luis    27   cdmx    15000           TI
4  jorge    56   cdmx    14000           TI
6  angel    42   cdmx    15500    marketing

# 5.Ordenar filas

In [60]:
#Ordena por salario de forma Descendente(Z-A, 9-0)
df.sort_values(by='Salario', ascending=False)

   Nombre  Edad       Ciudad  Salario Departamento
2   lucia    50  guadalajara    18000    marketing
6   angel    42         cdmx    15500    marketing
1    Luis    27         cdmx    15000           TI
4   jorge    56         cdmx    14000           TI
5   sofia    23  guadalajara    13000       ventas
0     ana    29    monterrey    12000       ventas
3  martha    36       puebla    12000       ventas

In [59]:
#Ordena por salario de forma ascendente(A-Z, 0-9)
df.sort_values(by='Salario', ascending=True)

   Nombre  Edad       Ciudad  Salario Departamento
0     ana    29    monterrey    12000       ventas
3  martha    36       puebla    12000       ventas
5   sofia    23  guadalajara    13000       ventas
4   jorge    56         cdmx    14000           TI
1    Luis    27         cdmx    15000           TI
6   angel    42         cdmx    15500    marketing
2   lucia    50  guadalajara    18000    marketing

In [58]:
df.sort_values(by=['Ciudad', 'Salario'])

   Nombre  Edad       Ciudad  Salario Departamento
4   jorge    56         cdmx    14000           TI
1    Luis    27         cdmx    15000           TI
6   angel    42         cdmx    15500    marketing
5   sofia    23  guadalajara    13000       ventas
2   lucia    50  guadalajara    18000    marketing
0     ana    29    monterrey    12000       ventas
3  martha    36       puebla    12000       ventas

In [62]:
df['SalarioAnual'] = df['Salario'] * 12